order-service/test_1.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
    xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" 
    xmlns:tns="http://tempuri.org/" 
    xmlns:msb="http://schemas.microsoft.com/ws/06/2004/mspolicy/netbinary1" 
    xmlns:msf="http://schemas.microsoft.com/ws/2006/05/framing/policy">
    <soap:Body>
        <UpdateOrder xmlns="http://tempuri.org/">
            <licenseCode>AmericanaWeb</licenseCode>
            <conceptID>3</conceptID>
            <order>
                <licenseCode>AmericanaWeb</licenseCode>
                <language>en</language>
                <conceptID>3</conceptID>
                <order>
                    <AddressID>10512559</AddressID>
                    <ConceptID>3</ConceptID>
                    <CountryID>1</CountryID>
                    <CustomerID>7694266</CustomerID>
                    <DeliveryChargeID>279</DeliveryChargeID>
                    <DistrictID>-1</DistrictID>
                    <Entries>
                        <CEntry>
                            <ItemID>710001</ItemID>
                            <Level>0</Level>
                            <ModCode>NONE</ModCode>
                            <Name>Cheese Cake</Name>
                            <OrdrMode>OM_SAVED</OrdrMode>
                            <Price>9.5</Price>
                            <Status>NOTAPPLIED</Status>
                        </CEntry>
                        <CEntry>
                            <ItemID>710001</ItemID>
                            <Level>0</Level>
                            <ModCode>NONE</ModCode>
                            <Name>Cheese Cake</Name>
                            <OrdrMode>OM_SAVED</OrdrMode>
                            <Price>9.5</Price>
                            <Status>NOTAPPLIED</Status>
                        </CEntry>
                        <CEntry>
                            <ItemID>710001</ItemID>
                            <Level>0</Level>
                            <ModCode>NONE</ModCode>
                            <Name>Cheese Cake</Name>
                            <OrdrMode>OM_SAVED</OrdrMode>
                            <Price>9.5</Price>
                            <Status>NOTAPPLIED</Status>
                        </CEntry>
                        <CEntry>
                            <ItemID>710001</ItemID>
                            <Level>0</Level>
                            <ModCode>NONE</ModCode>
                            <Name>Cheese Cake</Name>
                            <OrdrMode>OM_SAVED</OrdrMode>
                            <Price>9.5</Price>
                            <Status>NOTAPPLIED</Status>
                        </CEntry>
                    </Entries>
                    <OrderID>0</OrderID>
                    <OrderMode>2</OrderMode>
                    <OrderType>0</OrderType>
                    <ProvinceID>7</ProvinceID>
                    <StoreID>1219</StoreID>
                    <StreetID>315</StreetID>
                </order>
                <autoApprove>true</autoApprove>
                <useBackupStoreIfAvailable>true</useBackupStoreIfAvailable>
                <orderNotes1>Test order notes 1</orderNotes1>
                <orderNotes2>Test order notes 2</orderNotes2>
                <creditCardPaymentbool>true</creditCardPaymentbool>
                <isSuspended>true</isSuspended>
                <menuTemplateID>17</menuTemplateID>
            </order>
            <autoApprove>true</autoApprove>
            <useBackupStoreIfAvailable>true</useBackupStoreIfAvailable>
            <creditCardPaymentbool>false</creditCardPaymentbool>
            <menuTemplateID>17</menuTemplateID>
        </UpdateOrder>
    </soap:Body>
</soap:Envelope>